In [40]:
import pandas as pd
file = 'Players.csv'
df = pd.read_csv(file)
df.head(3)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN

In [21]:
medias = ['height', 'weight']
df[medias].mean().round(2)

height    198.70
weight     94.78
dtype: float64

In [23]:
df['peso/altura'] = df['height']/df['weight']
df.head(3)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state,peso/altura
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN,2.337662
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana,2.265060
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN,2.244186

In [ ]:
df['birth_city'].value_counts().head(5)

birth_city
Chicago         114
Los Angeles      88
Philadelphia     83
Brooklyn         76
New York         71
Name: count, dtype: int64

In [37]:
df.loc[df['height'].idxmax(), 'Player']

'Manute Bol'